src/Documents/уатДоверенность/уатДоверенность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатДоверенность</name>
  <basedOn>Document.уатЗаказГрузоотправителя</basedOn>
  <basedOn>Document.уатМаршрутныйЛист</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.уатВидыОперацийДоверенность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказГрузоотправителя</name>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаПолучениеОт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДокументу</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.уатРеализацияУслуг</types>
      <types>DocumentRef.уатМаршрутныйЛист</types>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
      <types>DocumentRef.уатПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоверенногоЛица</name>
    <comment>0 - Сотрудник, 1 - Физическое лицо</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>НаименованиеТовара</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаКлассификатор</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьЕдиницаПоКлассификатору</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/уатВидыОперацийДоверенность/уатВидыОперацийДоверенность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыОперацийДоверенность</name>
  <enumValues>
    <name>Груз</name>
  </enumValues>
  <enumValues>
    <name>Запчасти</name>
  </enumValues>
</mdclass:Enum>

src/Enums/уатПринадлежностьТС/уатПринадлежностьТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатПринадлежностьТС</name>
  <enumValues>
    <name>Собственное</name>
  </enumValues>
  <enumValues>
    <name>Привлеченное</name>
  </enumValues>
  <enumValues>
    <name>Виртуальное</name>
  </enumValues>
</mdclass:Enum>

src/Documents/уатДоверенность/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Перем ЕдиницаИзмеренияШтука; // Хранит ссылку на единицу по классификатору "Штука" для вставки при подборе

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
	
		// Заполнение шапки
		ВидОперации					= Перечисления.уатВидыОперацийДоверенность.Груз;
		ЗаказГрузоотправителя   	= ДанныеЗаполнения;
		Основание 					= ДанныеЗаполнения;
		ПоДокументу					= Документы.уатДоверенность.ПолучитьПредставлениеОснования(Основание);
		ДоговорКонтрагента 			= ДанныеЗаполнения.ДоговорКонтрагента;
		Контрагент 					= ДанныеЗаполнения.Контрагент;
		НаПолучениеОт				= Документы.уатДоверенность.ПолучитьПолноеНаименованиеКонтрагента(Контрагент);
		Организация 				= ДанныеЗаполнения.Организация;
		БанковскийСчетОрганизации 	= Организация.ОсновнойБанковскийСчет;
		Ответственный 				= уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
						  			ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнойОтветственный");
									
		Если НЕ ЗначениеЗаполнено(ДатаДействия) Тогда
			ДатаДействия = Дата + 10 * (24 * 60 * 60);
		КонецЕсли;
									
		// восстановим документ-основание Маршрутный лист
		ОснованиеМаршрутныйЛист = Неопределено;
		ДополнительныеСвойства.Свойство("ОснованиеМаршрутныйЛист",ОснованиеМаршрутныйЛист);
		Если ЗначениеЗаполнено(ОснованиеМаршрутныйЛист) Тогда
			Основание = ОснованиеМаршрутныйЛист;
			ДоверенноеЛицо	   = Основание.Водитель1;
			ТипДоверенногоЛица = ?(ТипЗнч(ДоверенноеЛицо) = Тип("СправочникСсылка.Сотрудники"),0,1);
		КонецЕсли;
		
		// Заполнение табличной части
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.НаименованиеТовара = ДанныеЗаполнения.ВидГрузаДляДоверенности;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.ЕдиницаКлассификатор = ЕдиницаИзмеренияШтука; 
		
		// Поиск доверенного лица в связанных маршрутных листах, если создается не из Маршрутного листа
		Если НЕ ЗначениеЗаполнено(ДоверенноеЛицо) Тогда
			ЗапросМЛ = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	уатМаршрутныйЛист.Ссылка КАК Ссылка,
			|	уатМаршрутныйЛист.Водитель1 КАК Водитель1
			|ИЗ
			|	Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
			|ГДЕ
			|	уатМаршрутныйЛист.Заказы.ЗаказГрузоотправителя = &ЗаказГрузоотправителя
			|	И уатМаршрутныйЛист.Проведен
			|	И НЕ уатМаршрутныйЛист.ПометкаУдаления
			|	И уатМаршрутныйЛист.ПринадлежностьПеревозки <> ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьТС.Виртуальное)
			|
			|УПОРЯДОЧИТЬ ПО
			|	уатМаршрутныйЛист.Дата");
			ЗапросМЛ.УстановитьПараметр("ЗаказГрузоотправителя", Основание);
			ВыборкаМЛ = ЗапросМЛ.Выполнить().Выбрать();
			Если ВыборкаМЛ.Следующий() Тогда
				ДоверенноеЛицо	   = ВыборкаМЛ.Водитель1;
				ТипДоверенногоЛица = ?(ТипЗнч(ДоверенноеЛицо) = Тип("СправочникСсылка.Сотрудники"),0,1);
			КонецЕсли; 
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	// проверка на ведение складского учета средствами УАТ
	Если НЕ уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.ВестиСкладскойУчетУАТ) Тогда
		
		ТекстНСТР = НСтр("en='For company ""%1"" the possibility of inventory management with FMS documents is disabled!';ru='Для организации ""%1"" отключена возможность ведения складского учета документами УАТ!'");
		ТекстНСТР = СтрШаблон(ТекстНСТР, Организация);
		уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, Отказ,, СтатусСообщения.Внимание);
		
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	уатУчетОригиналовПервичныхДокументов.СформироватьДвиженияРеестрДокументов(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#Область Инициализация

ЕдиницаИзмеренияШтука = Документы.уатДоверенность.НайтиЕдиницуШтука();

#КонецОбласти

#КонецЕсли
